ARMmbed/mbed-os/targets/TARGET_STM/TARGET_STM32F0/TARGET_STM32F091xx/device/stm32f091xx.h
/* Aliases for __IRQn */
#define ADC1_IRQn                ADC1_COMP_IRQn
#define DMA1_Channel1_IRQn       DMA1_Ch1_IRQn
#define DMA1_Channel2_3_IRQn     DMA1_Ch2_3_DMA2_Ch1_2_IRQn
#define DMA1_Channel4_5_6_7_IRQn DMA1_Ch4_7_DMA2_Ch3_5_IRQn
#define DMA1_Channel4_5_IRQn     DMA1_Ch4_7_DMA2_Ch3_5_IRQn
#define PVD_IRQn                 PVD_VDDIO2_IRQn
#define VDDIO2_IRQn              PVD_VDDIO2_IRQn
#define RCC_IRQn                 RCC_CRS_IRQn
#define TIM6_IRQn                TIM6_DAC_IRQn
#define USART3_4_IRQn            USART3_8_IRQn
#define USART3_6_IRQn            USART3_8_IRQn


/* Aliases for __IRQHandler */
#define ADC1_IRQHandler                ADC1_COMP_IRQHandler
#define DMA1_Channel1_IRQHandler       DMA1_Ch1_IRQHandler
#define DMA1_Channel2_3_IRQHandler     DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler
#define DMA1_Channel4_5_IRQHandler     DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler
#define PVD_IRQHandler                 PVD_VDDIO2_IRQHandler
#define VDDIO2_IRQHandler              PVD_VDDIO2_IRQHandler
#define RCC_IRQHandler                 RCC_CRS_IRQHandler
#define TIM6_IRQHandler                TIM6_DAC_IRQHandler
#define USART3_4_IRQHandler            USART3_8_IRQHandler
#define USART3_6_IRQHandler            USART3_8_IRQHandler


#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __STM32F091xx_H */

/**
  * @}
  */

  /**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
